app/Http/Helpers/helpers.php

function get_admin_notifications()
{
    $admin = auth()->user();
    $notification_clear_at =   $admin->notification_clear_at;
    if ($notification_clear_at  == null) {
        $notifications = AdminNotification::notAuth()->getByType([NotificationConst::SIDE_NAV])->get();
---
select * from `admin_notifications` where `admin_id` != 1 and `type` in ('SIDE_NAV')