app/Http/Controllers/Admin/Auth/LoginController.php

    protected function createLoginLog($admin) {

        $client_ip = request()->ip() ?? false;
        $location = geoip()->getLocation($client_ip);

        $agent = new Agent();


        $mac = "";

        $data = [
            'admin_id'      => $admin->id,
            'ip'            => $client_ip,
            'mac'           => $mac,
            'city'          => $location['city'] ?? "",
            'country'       => $location['country'] ?? "",
            'longitude'     => $location['lon'] ?? "",
            'latitude'      => $location['lat'] ?? "",
            'timezone'      => $location['timezone'] ?? "",
            'browser'       => $agent->browser() ?? "",
            'os'            => $agent->platform() ?? "",
        ];

        try{
            AdminLoginLogs::create($data);
            $notification_message = [
                'title'   => $admin->fullname . "(" . $admin->username . ")" . " logged in.",
                'time'      => Carbon::now()->diffForHumans(),
                'image'     => get_image($admin->image,'admin-profile'),
            ];
            AdminNotification::create([
                'type'      => NotificationConst::SIDE_NAV,
                'admin_id'  => $admin->id,
                'message'   => $notification_message,
            ]);
---
insert into `admin_notifications` (`type`, `admin_id`, `message`, `updated_at`, `created_at`) values ('SIDE_NAV', 1, '{\"title\":\"Super Admin(superadmin) logged in.\",\"time\":\"1 second ago\",\"image\":\"http:\/\/localhost\/esalon\/public\/backend\/images\/default\/default.webp\"}', '2023-10-25 13:27:52', '2023-10-25 13:27:52')

    protected function updateInfo($admin) {
        try{
            $admin->update([
                'last_logged_in'    => now(),
                'login_status'      => true,
            ]);
---
update `admins` set `last_logged_in` = '2023-10-25 13:27:53', `login_status` = 1, `admins`.`updated_at` = '2023-10-25 13:27:53' where `id` = 1