app/Http/Controllers/Frontend/AppointmentBookingController.php

    public function makeAppointment(Request $request,$slug){
        $page_title         = "| Parlour Booking";
        $parlour            = ParlourList::with(['schedules'])->where('slug',$slug)->first();
        $service_types      = ServiceType::where('status',true)->get();
        $payment_gateway   = PaymentGatewayCurrency::whereHas('gateway', function ($gateway) {
            $gateway->where('slug', PaymentGatewayConst::payment_method_slug());
            $gateway->where('status', 1);
        })->get();
        $validated_user     = auth()->user();
        $footer_slug        = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer             = SiteSections::getData($footer_slug)->first();
        $usefull_links      = UsefullLink::where('status',true)->get();
---
select * from `parlour_lists` where `slug` = '82fd5767-0302-407b-b908-1f852c77f7e7' limit 1
select * from `service_types` where `status` = 1
select * from `payment_gateway_currencies` where exists (select * from `payment_gateways` where `payment_gateway_currencies`.`payment_gateway_id` = `payment_gateways`.`id` and `slug` = 'payment-method' and `status` = 1)
select * from `usefull_links` where `status` = 1

    public function store(Request $request){
        $validator              = Validator::make($request->all(),[
            'parlour'           => 'required',
            'schedule'          => 'required',
            'price'             => 'required',
            'payment_gateway'   => 'required',
            'name'              => 'required',
            'mobile'            => 'nullable',
            'email'             => 'required',
            'gender'            => 'required',
            'type'              => "nullable|array",
            'type.*'            => "nullable|string|max:255",
            'message'           => "nullable"
        ]);
        if($validator->fails()){
            return back()->withErrors($validator)->withInput($request->all());
        }
        $validated                  = $validator->validate();
        $validated['slug']          = Str::uuid();
        $slug                       = $validated['parlour'];
        $payment_gateway            = $validated['payment_gateway'];
        $parlour                    = ParlourList::where('slug',$slug)->first();
---
select * from `parlour_lists` where `slug` = '672d793a-5812-4e63-bd7b-a775e3f50b10' limit 1


        $validated['parlour_id']   = $parlour->id;

        $schedule = ParlourListHasSchedule::where('id',$validated['schedule'])->whereHas('parlour',function($q) use ($parlour) {
            $q->where('id',$parlour->id);
        })->first();
---
select * from `parlour_list_has_schedules` where `id` = '18' and exists (select * from `parlour_lists` where `parlour_list_has_schedules`.`parlour_list_id` = `parlour_lists`.`id` and `id` = 6) limit 1

            return back()->with(['error' => ['Schedule Not Found!']]);
        }
        $validated['schedule_id'] = $validated['schedule'];
        $payment_method     = PaymentGatewayCurrency::where('id',$payment_gateway)->first();
        if(!$payment_method) return back()->with(['error' => ['Payment Gateway Not Found!']]);

        $validated['payment_gateway_currency_id']   = $payment_method->id;
        $alrady_appointed = ParlourBooking::where('parlour_id',$parlour->id)->where('schedule_id',$validated['schedule_id'])->count();
---
select * from `payment_gateway_currencies` where `id` = '2' limit 1
select count(*) as aggregate from `parlour_bookings` where `parlour_id` = 6 and `schedule_id` = '18'

        $next_appointment_no = $alrady_appointed + 1;
        $validated['serial_number'] = $next_appointment_no;
        try{
            $booking = ParlourBooking::create($validated);
---
insert into `parlour_bookings` (`price`, `name`, `mobile`, `email`, `gender`, `message`, `type`, `slug`, `user_id`, `parlour_id`, `schedule_id`, `payment_gateway_currency_id`, `serial_number`, `updated_at`, `created_at`) values ('120', 'Test User', '16545454', 'user@appdevs.net', 'Male', '', '[\"Hair Wash\",\"Hair Color\"]', '\"8016fb57-e290-48ce-a701-5c1d5697f3fa\"', 1, 6, '18', 2, 2, '2023-10-25 15:55:33', '2023-10-25 15:55:33')

    public function preview(Request $request,$slug){
        $page_title         = "Appointment Preview";
        $booking            = ParlourBooking::with(['parlour','schedule','payment_gateway'])->where('slug',$slug)->first();
        $footer_slug        = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer             = SiteSections::getData($footer_slug)->first();
        $usefull_links      = UsefullLink::where('status',true)->get();
---
select * from `parlour_bookings` where `slug` = '8016fb57-e290-48ce-a701-5c1d5697f3fa' limit 1
select * from `usefull_links` where `status` = 1