app/Http/Controllers/Frontend/SiteController.php

select * from `areas` where `status` = 1
select * from `parlour_lists` where `status` = 1 order by `created_at` desc limit 4
select * from `usefull_links` where `status` = 1
---
    public function index(){
        $slider_slug            = Str::slug(SiteSectionConst::SLIDER_SECTION);
        $sliders                = SiteSections::getData($slider_slug)->first();
        $areas                  = Area::where('status',true)->get();
        $parlour_lists          = ParlourList::where('status',true)->latest()->take(4)->get();
        $how_its_work_slug      = Str::slug(SiteSectionConst::HOW_ITS_WORK_SECTION);
        $how_its_work           = SiteSections::getData($how_its_work_slug)->first();
        $testimonial_slug       = Str::slug(SiteSectionConst::TESTIMONIAL_SECTION);
        $testimonial            = SiteSections::getData($testimonial_slug)->first();
        $statistic_slug         = Str::slug(SiteSectionConst::STATISTIC_SECTION);
        $statistic              = SiteSections::getData($statistic_slug)->first();
        $photo_gallery_slug     = Str::slug(SiteSectionConst::PHOTO_GALLERY_SECTION);
        $photo_gallery          = SiteSections::getData($photo_gallery_slug)->first();
        $download_app_slug      = Str::slug(SiteSectionConst::DOWNLOAD_APP_SECTION);
        $download_app           = SiteSections::getData($download_app_slug)->first();
        $footer_slug            = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer                 = SiteSections::getData($footer_slug)->first();
        $usefull_links          = UsefullLink::where('status',true)->get();

select * from `areas` where `status` = 1
select * from `parlour_lists` where `status` = 1 order by RAND()
select * from `usefull_links` where `status` = 1
---
    public function findParlour(){
        $page_title             = "| Find Parlour";
        $areas                  = Area::where('status',true)->get();
        $parlour_lists          = ParlourList::where('status',true)->inRandomOrder()->get();
        $footer_slug            = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer                 = SiteSections::getData($footer_slug)->first();
        $usefull_links          = UsefullLink::where('status',true)->get();

select * from `areas` where `status` = 1
select * from `usefull_links` where `status` = 1
select * from `parlour_lists` where `area_id` = '2' and `name` like '%Evolve%'
select * from `parlour_lists` where `area_id` = '2'
select * from `parlour_lists` where `name` like '%%'
---
    public function searchParlour(Request $request){

        $page_title             = "| Find Parlour";
        $areas                  = Area::where('status',true)->get();
        $footer_slug            = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer                 = SiteSections::getData($footer_slug)->first();
        $usefull_links          = UsefullLink::where('status',true)->get();
        $contact_slug           = Str::slug(SiteSectionConst::CONTACT_SECTION);
        $contact                = SiteSections::getData($contact_slug)->first();

        $validator = Validator::make($request->all(),[
            'area'          => 'nullable',
            'name'       => 'nullable',
        ]);
        if($validator->fails()) {
            return back()->with(['error' => ['Something went wrong! Please try again.']]);
        }
        if($request->area && $request->name ){

            $parlour_lists    = ParlourList::where('area_id',$request->area)->where('name','like','%'.$request->name.'%')->get();

        }else if($request->area){
            $parlour_lists    = ParlourList::where('area_id',$request->area)->get();
        }
        else {
            $parlour_lists    = ParlourList::where('name','like','%'.$request->name.'%')->get();

select * from `parlour_lists` where `slug` = '672d793a-5812-4e63-bd7b-a775e3f50b10' limit 1
select * from `usefull_links` where `status` = 1
---
    public function parlourBooking(Request $request,$slug){
        $page_title         = "| Parlour Booking";
        $parlour            = ParlourList::with(['schedules'])->where('slug',$slug)->first();
        $footer_slug        = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer             = SiteSections::getData($footer_slug)->first();
        $usefull_links      = UsefullLink::where('status',true)->get();

select * from `usefull_links` where `status` = 1
---
    public function service(){
        $page_title             = "| Services";
        $service_slug           = Str::slug(SiteSectionConst::SERVICE_SECTION);
        $service                = SiteSections::getData($service_slug)->first();
        $footer_slug            = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer                 = SiteSections::getData($footer_slug)->first();
        $usefull_links          = UsefullLink::where('status',true)->get();

select * from `usefull_links` where `status` = 1
---
    public function contact(){
        $page_title             = "| Contact";
        $footer_slug            = Str::slug(SiteSectionConst::FOOTER_SECTION);
        $footer                 = SiteSections::getData($footer_slug)->first();
        $usefull_links          = UsefullLink::where('status',true)->get();

insert into `contact_requests` (`name`, `email`, `message`, `created_at`, `updated_at`) values ('Amir', 'amirsohelto@gmail.com', 'drdty', '2023-09-24 09:01:43', '2023-09-24 09:01:43')
---
    public function contactRequest(Request $request) {

        $validator        = Validator::make($request->all(),[
            'name'        => "required|string|max:255|unique:contact_requests",
            'email'       => "required|string|email|max:255|unique:contact_requests",
            'message'     => "required|string|max:5000",
        ]);
        if($validator->fails()) return back()->withErrors($validator)->withInput();
        $validated = $validator->validate();
        try{
            ContactRequest::create([
                'name'            => $validated['name'],
                'email'           => $validated['email'],
                'message'         => $validated['message'],
                'created_at'      => now(),
            ]);