app/Http/Controllers/Admin/ParlourListController.php

select * from `parlour_lists` order by `id` desc
---
    public function index(){
        $page_title     = "Parlour List";
        $parlour_lists  = ParlourList::orderBYDESC('id')->get();