app/Http/Controllers/Admin/PaymentGatewaysController.php

    public function automaticPaymentMethodStore(Request $request) {
        $gateway_name = $request->gateway_name;
        $validator = Validator::make($request->all(),[
            'gateway_name'              => ['required','string','max:60',Rule::unique('payment_gateways','alias')->where(function($query) use ($gateway_name) {
                $alias = Str::slug($gateway_name);
                $query->where('slug',PaymentGatewayConst::payment_method_slug())->where('type',PaymentGatewayConst::AUTOMATIC)->where('alias',$alias);
            })],
            'gateway_title'             => 'required|string|max:60',
            'supported_currencies'      => 'required|array',
            'supported_currencies.*'    => 'string|max:30',
            'title'                     => 'required|array',
            'title.*'                   => 'string|max:60',
            'name'                      => 'required|array',
            'name.*'                    => 'string|max:60',
            'value'                     => 'nullable|array',
            'value.*'                   => 'nullable|string|max:255',
            'image'                     => 'nullable|image|mimes:png,jpg,jpeg,svg,webp',
        ]);

        $validator->after(function ($validator) use ($gateway_name) {
            // Search Gateway is unique or not
            if(PaymentGateway::paymentMethod()->automatic()->gateway(Str::slug($gateway_name))->exists()) {
---
select exists(select * from `payment_gateways` where (`slug` = 'payment-method') and (`type` = 'AUTOMATIC') and `alias` = 'flutterwave') as `exists`


        $validated = Arr::except($validated,['value','gateway_name','gateway_title']);

        $last_record_of_max_code = PaymentGateway::max('code') ?? 100;
---
select max(`code`) as aggregate from `payment_gateways`

        }

        try{
            PaymentGateway::create($validated);
---
insert into `payment_gateways` (`supported_currencies`, `title`, `name`, `credentials`, `slug`, `type`, `alias`, `last_edit_by`, `code`, `updated_at`, `created_at`) values ('[\"NGN\",\"USD\"]', 'Flutterwave Gateway', 'Flutterwave', '[{\"label\":\"Encryption key\",\"placeholder\":\"Enter Encryption key\",\"name\":\"encryption-key\",\"value\":\"FLWSECK_TEST27bee2235efd\"},{\"label\":\"Secret key\",\"placeholder\":\"Enter Secret key\",\"name\":\"secret-key\",\"value\":\"FLWSECK_TEST-da35e3dbd28be1e7dc5d5f3519e2ebef-X\"},{\"label\":\"Public key\",\"placeholder\":\"Enter Public key\",\"name\":\"public-key\",\"value\":\"FLWPUBK_TEST-e0bc02a00395b938a4a2bed65e1bc94f-X\"}]', 'payment-method', 'AUTOMATIC', 'flutterwave', 1, 110, '2023-10-25 09:24:56', '2023-10-25 09:24:56')

        }

        try{
            PaymentGatewayCurrency::where('payment_gateway_id',$gateway->id)->upsert($data_ready_to_work,['alias']);
---
insert into `payment_gateway_currencies` (`alias`, `created_at`, `currency_code`, `currency_symbol`, `image`, `name`, `payment_gateway_id`, `rate`, `updated_at`) values ('payment-method-flutterwave-ngn-automatic', '2023-10-25 14:47:42', 'NGN', '₦', '', 'Flutterwave NGN', 2, '766', '2023-10-25 14:47:42') on duplicate key update `rate` = values(`rate`), `currency_symbol` = values(`currency_symbol`), `currency_code` = values(`currency_code`), `name` = values(`name`), `alias` = values(`alias`), `payment_gateway_id` = values(`payment_gateway_id`), `image` = values(`image`), `updated_at` = values(`updated_at`)

    public function manualPaymentMethodUpdate(Request $request,$alias) {

        // Find gateway is available or not
        $gateway = PaymentGateway::paymentMethod()->manual()->gateway($alias)->first();
        if(!$gateway) {
            return back()->with(['error' => ['Oops! Payment gateway not found!']]);
        }

        // Validate Data
        $gateway_name = $request->gateway_name;
        $validator = Validator::make($request->all(),[
            'gateway_name'          => ['required','string','max:60',Rule::unique('payment_gateways','alias')->where(function($query) use ($gateway_name, $gateway) {
                $alias = Str::slug($gateway_name);
                $query->whereNot('id',$gateway->id)->where('slug',PaymentGatewayConst::payment_method_slug())->where('type',PaymentGatewayConst::MANUAL)->where('alias',$alias);
            })],
            'desc'                  => 'nullable|string|max:10000',
            'label'                 => 'nullable|array',
            'label.*'               => 'nullable|string|max:50',
            'input_type'            => 'nullable|array',
            'input_type.*'          => 'nullable|string|max:20',
            'min_char'              => 'nullable|array',
            'min_char.*'            => 'nullable|numeric',
            'max_char'              => 'nullable|array',
            'max_char.*'            => 'nullable|numeric',
            'field_necessity'       => 'nullable|array',
            'field_necessity.*'     => 'nullable|string|max:20',
            'file_extensions'       => 'nullable|array',
            'file_extensions.*'     => 'nullable|string|max:255',
            'file_max_size'         => 'nullable|array',
            'file_max_size.*'       => 'nullable|numeric',
            'image'                 => 'nullable|image|mimes:jpg,png,svg,jpeg,webp',
---
select * from `payment_gateways` where (`slug` = 'payment-method') and (`type` = 'MANUAL') and `alias` = 'lysandra-hernandez' limit 1


        $validator->after(function ($validator) use ($gateway_name,$gateway) {
            // Search Gateway is unique or not
            if(PaymentGateway::whereNot(function($query) use ($gateway) {
                $query->where('id',$gateway->id);
            })->where(function($query) use ($gateway_name){
                $alias = Str::slug($gateway_name);
                $query->where('slug',PaymentGatewayConst::payment_method_slug())
                ->where('type',PaymentGatewayConst::MANUAL)
                ->where('alias',$alias);
            })->exists()) {
---
select exists(select * from `payment_gateways` where not (`id` = 5) and (`slug` = 'payment-method' and `type` = 'MANUAL' and `alias` = 'lysandra-hernandez')) as `exists`