app/Http/Controllers/Admin/ServiceTypeController.php

select * from `service_types` order by `id` desc limit 15 offset 0
select count(*) as aggregate from `service_types`
---
    public function index(){
        $page_title     = "Service Type";
        $service_types  = ServiceType::orderBYDESC('id')->paginate(15);

select exists(select * from `service_types` where `name` = 'Hair Wash') as `exists`
insert into `service_types` (`name`, `price`, `slug`, `updated_at`, `created_at`) values ('Hair Wash', '40', 'hair-wash', '2023-10-25 06:38:38', '2023-10-25 06:38:38')
---
    public function store(Request $request){
        $validator      = Validator::make($request->all(),[
            'name'      => 'required|string',
            'price'     => 'required',
        ]);

        if($validator->fails()) return back()->withErrors($validator)->withInput()->with("modal","add-service-type");

        $validated     = $validator->validate();
        $validated['slug']   = Str::slug($request->name);
        if(ServiceType::where('name',$validated['name'])->exists()){
            throw ValidationException::withMessages([
                'name'   => 'Service Type already exists',
            ]);
        }
        try{
            ServiceType::create($validated);

select * from `service_types` where `service_types`.`id` = '1' limit 1
update `service_types` set `status` = 0, `service_types`.`updated_at` = '2023-10-25 04:34:40' where `id` = 1
---
    public function statusUpdate(Request $request) {
        $validator = Validator::make($request->all(),[
            'data_target'       => 'required|numeric|exists:areas,id',
            'status'            => 'required|boolean',
        ]);

        if($validator->fails()) {
            $errors = ['error' => $validator->errors() ];
            return Response::error($errors);
        }

        $validated = $validator->validate();


        $service_type = ServiceType::find($validated['data_target']);

        try{
            $service_type->update([
                'status'        => ($validated['status']) ? false : true,
            ]);