app/Http/Controllers/Admin/SetupSectionsController.php

select * from `languages`
---
    public function __construct()
    {
        $this->languages = Language::get();